# HasVectorSettings Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayStyle..::..HasVectorSettings Method
AnalysisDisplayStyle Class See Also
---
If true style has vector settings.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool HasVectorSettings()
```

Visual Basic
---
```text
Public Function HasVectorSettings As Boolean
```

Visual C++
---
```text
public:
bool HasVectorSettings()
```

# See Also
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace